In [7]:
# pandas equivalent of SQL statements

import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame({
    "id" : [1,2,3,4,5],
    "name" : ["Batman", "Alfred", "Robin", "Joker", "Scarecrow"],
    "language" : ["C", "C++", "Python", "Java", "ASM"],
    "salary" : [10000000, 100000, 950000, 65000000, 80000],
    "year" : [2000, 1997, 2020, 2000, 2003] 
})

In [11]:
# SQL: SELECT * FROM DATASET

df

   id       name language    salary  year
0   1     Batman        C  10000000  2000
1   2     Alfred      C++    100000  1997
2   3      Robin   Python    950000  2020
3   4      Joker     Java  65000000  2000
4   5  Scarecrow      ASM     80000  2003